import Image from "next/image";

function AboutStore() {
  return (
    <div className=" grid grid-cols-1 gap-6 max-w-2xl  mx-auto shadow-2xl my-5 p-5 rounded-2xl">
      <div className="flex justify-center ">
        <div className="relative w-full h-64">
          <Image
            src="/images/logo/AboutStore.jpg"
            alt="logo"
            fill
            className="object-cover rounded-2xl"
          />
        </div>
      </div>
      <div className="  flex flex-col gap-5 ">
        <h1 className=" text-xl font-bold text-emerald-600 text-right ">
          درباره ما
        </h1>
        <div className="text-right flex flex-col gap-4 text-emerald-700">
          <p>
            به کفشو خوش آمدید؛ جایی که کیفیت، راحتی و سلامت در کنار هم معنا پیدا
            می‌کنند. ما فعالیت خود را با هدف ایجاد تجربه‌ای متفاوت در خرید کفش
            آغاز کردیم؛ تجربه‌ای که در آن مشتری بتواند با اطمینان، آسودگی و تنوع
            بالا بهترین انتخاب را داشته باشد
          </p>
          <p>
            ما باور داریم که پاها قلب دوم انسان هستند و نقش مهمی در سلامت و
            کیفیت زندگی روزمره دارند. به همین دلیل تلاش کرده‌ایم مجموعه‌ای از
            کفش‌های متنوع، باکیفیت و مناسب برای سلیقه‌ها و نیازهای مختلف را
            فراهم کنیم. از مدل‌های روزمره و اسپرت گرفته تا کفش‌های مناسب
            پیاده‌روی و استفاده روزانه، همه محصولات ما با دقت انتخاب می‌شوند تا
            راحتی و رضایت شما را به همراه داشته باشند.
          </p>
          <p>
            هدف ما تنها فروش یک محصول نیست؛ بلکه می‌خواهیم همراه قدم‌های شما
            باشیم و با ارائه محصولاتی باکیفیت، حس رضایت و اعتماد را برای مشتریان
            خود ایجاد کنیم. ما همواره تلاش می‌کنیم با ارائه خدمات بهتر، تنوع
            بیشتر و توجه ویژه به نیازهای مشتریان، تجربه‌ای لذت‌بخش از خرید
            آنلاین را فراهم کنیم.
          </p>
          <p>
            اعتماد و رضایت مشتریان برای ما بزرگ‌ترین سرمایه است. به همین دلیل
            همواره سعی داریم با ارائه اطلاعات دقیق، پشتیبانی مناسب و خدماتی
            مطمئن، رابطه‌ای پایدار و دوستانه با مشتریان خود ایجاد کنیم. ما
            معتقدیم هر قدمی که برمی‌دارید باید همراه با آرامش، راحتی و اطمینان
            باشد.
          </p>
          <p>
            در کفشو کیفیت یک انتخاب نیست، بلکه یک تعهد است. ما هر روز تلاش
            می‌کنیم تا با ارائه بهترین محصولات و خدمات، در مسیر رشد و پیشرفت قدم
            برداریم و تجربه‌ای متفاوت را برای شما رقم بزنیم.
          </p>
        </div>
        <h2 className="flex justify-center text-xl font-bold text-emerald-600 mb-5">
          کفشو؛ با ما راحت قدم بردارید، با سلامت زندگی کنید.
        </h2>
      </div>
    </div>
  );
}

export default AboutStore;
